package kr.co.sist.memo;





/**
 * 
 * 
 * 추가버튼이 눌려지면 이름,나이,성별,전화번호를 D.L.M에 추가한다.<br>
 * 변경 버튼이 눌려지면 입력된 이름, 나이, 전화번호를 사용하여 D.L.M에 추가되어있는 이름과 같은 사람의 (나이와 전화번호)를 입력된 값으로 변경 <br>
 * 예 ) DLM아래와 같은 정보가 입력<br>
 * 진수현,20,남,010-1234-5678
 * 김동섭,21,남,010-2345-6789
 *
 * 입력값 -> 진수현 ,22 , 남 , 010-5555-5555
 * 
 * 결과 )
 * 진수현,22,남,010-5555,5555
 * 김동섭,21,남,010-2345-6789
 * 
 * 이름이 입력된 후 "삭제"버튼이 눌려지면 DLM에 입력된 이름과 같은 모든 아이템을 삭제.<br>
 * 
 * 종료버튼을 누를시 프로그램을 종료.<br>
 * 
 * 
 * 
 * 
 */
public class RunJavaMemo {

	public static void main(String[] args) {

	//new JavaMemo();
	//  new Manual();
		
		
	 
	 
	 
	 
		
	}//main

}//class
