package day0104;

/**
 * //숙제 1. 구구단 전체단을 옆으로 출력해보세요
 * -------------------------------------------------------------- 2 x 1 = 2 3 x
 * 1 = 3 4 x 1 = 4 .......9 x 1 = 9
 *
 *
 *
 * 2 x 9 = 18 3 x 9 = 27 4 x 9 = 36 ......9 x 9 = 81
 * --------------------------------------------------------------
 *
 * 2. 아래와 같은 형태로 숫자 앞에 공백을 넣어서 출력해보세요. 0 1 2 3 4 5.....
 *
 * 3. 1에서 부터 100까지의 수중 3의 배수 합을 출력해보세요.
 *
 */
public class HomeWork {

	public static void main(String[] args) {

		// 1
		for (int i = 1; i <= 9; i++) {
			for (int j = 2; j <= 9; j++) {
				System.out.print(j + " * " + i + " = " + (j * i) + "\t");

			}
			System.out.println();
		}

		System.out.println(
				"--------------------------------------------------------------------------------------------------------");

		// 2
		int point = 0;
		for (int i = 0; i <= 5; i++) {
			for (int j = 0; j < i; j++) {
				System.out.print(" ");
			}

			System.out.println(point);
			point++;

		}

		System.out.println(
				"----------------------------------------------------------------------------------------------------");

		// 3

		int sum = 0;
		for (int i = 1; i < 101; i++) {
			if (i % 3 == 0) {
				sum += i;
			}

		}
		System.out.println("1 ~ 100까지의 수중 3의배수의 합 = " + sum);

		
		
	}// main

}// class
